//GIT - распределенная система контроля версий.
Это система для отслеживания и ведения истории изменений ваших файлов, которые вы отслеживаете при поммощи гита и их изменений

1. git init -  создает новый гит репозиторий на вашем пк локально, создаст она в той директории кде вы запускаеие эту команду.

2. git add - когда мы создаем и изменяем файлы то при помощи этой команды мы загружаем все изменения в промежуточное место хранения

git add <file_name>
git add . - добавляет все в текущей директории в промеж. хранилище

3. git commit - когда ммы достигаем определенного момента в разработке, то мы сохраняем и комментируем все наши изменения в репозитории (фиксация изменений в репо)

git commit -m '<comment>'

4. 
